thesis/listings/streaming-message-stop.xml

<soap:Envelope
	xmlns:soap="http://www.w3.org/2003/05/soap-envelope"
	xmlns:wsa="http://www.w3.org/2005/08/addressing"
	xmlns:stream="https://github.com/autermann/streaming-wps">
  <soap:Header>
    <wsa:MessageID>uuid:01ea8dab-5da9-46eb-81b4-06dcea32ca01</wsa:MessageID>
    <wsa:Action>https://github.com/autermann/streaming-wps/stop</wsa:Action>
  </soap:Header>
  <soap:Body>
    <stream:StopMessage>
      <stream:ProcessID>uuid:c99e6f21-f0a0-4770-9615-db3501490f0a</stream:ProcessID>
    </stream:StopMessage>
  </soap:Body>
</soap:Envelope>